[
  {
    "name": "Azmatullah Omarzai",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Allrounder",
    "description": " Azmatullah Omarzai player profile A fast-bowling allrounder who can bowl in the powerplay and hit big sixes down the order is always a prized asset in cricket, and Azmatullah Omarzai is no different.Omarzai became a key factor in helping Afghanistan transform from a spin-heavy attack to a more well-rounded team.When Omarzai started his career, he was a batter, with bowling a secondary skill."
  },
  {
    "name": "Najibullah Zadran",
    "team": "Afghanistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Najibullah Zadran packs a punch with his bellicose left-hand batting, despite his slight frame. He has followed the same tried and tested route to the national side as many of his generation that came after the initial Afghan cricketing pioneers, with age-group cricket preparing him for the big stage. His ODI debut, against Ireland in Dublin in 2012, was possibly a little premature but Zadran's batting turned a corner in 2014 and he started to look more at home."
  },
  {
    "name": "Fazalhaq Farooqi",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "A left-arm quick who can swing the ball both ways at pace, it didn't take Fazalhaq Farooqi long to become the leader of Afghanistan's pace attack in white-ball cricket after he made his international debut in 2021. Farooqi is now the go-to man with the new ball for Afghanistan, and most teams that he represents in franchise leagues around the globe. After working with Dwayne Bravo across franchises as well as during his stint as Afghanistan's fast-bowling consultant, Farooqi has developed his death-bowling skills to become a potent weapon."
  },
  {
    "name": "Naveen Ul Haq",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "A feisty fast bowler with a wide range of slower-ball variations, Naveen-ul-Haq first rose to prominence as a death-overs specialist, but soon developed his new-ball skills to become a useful weapon across phases. Like many of his compatriots, he is an in-demand commodity in franchise leagues across the world.\nBorn in Kabul, Naveen fled with his family to Pakistan in his early years, and began playing tape-ball cricket there."
  },
  {
    "name": "Gulbadin Naib",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Batting Allrounder",
    "description": "Gulbadin Naib's first love in sport was amateur bodybuilding, not cricket. When he eventually did take the game up, however, he progressed quickly through Afghanistan's age-group sides as a batting allrounder and was the youngest member of the team that won the Division Five tournament in 2008 - the first stepping stone to the full world stage.But Naib was dropped soon after, and had to deal with hardship in his personal life: his father was unemployed, his mother had hepatitis, and the family was struggling to deal with the needs of his disabled sister."
  },
  {
    "name": "Fareed Ahmad",
    "team": "Afghanistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Qais Ahmad",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Ibrahim Zadran",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Opening Batter",
    "description": "Top-order batter Ibrahim Zadran is among Afghanistan's most consistent performers, and young enough to have made his Test debut (in the team's third ever match) before he played a white-ball international. He made 87 in that match in Chattogram, a big, historic win over Bangladesh. Zadran, a veteran of two Under-19 World Cups in which he was his side's top run-scorer, got off to a storming start in senior international cricket: he made three hundreds in five ODIs when he came back to the format following a two-year hiatus after his first match, in 2019."
  },
  {
    "name": "Darwish Rasooli",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": []
  },
  {
    "name": "Usman Ghani",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Opening Batter",
    "description": "One of the most exciting new talents to emerge from Afghanistan's cricket programmes in recent years, intrepid opening batsman Usman Ghani was good enough to play one-day international cricket for Afghanistan well before his 18th birthday. Ghani was also good enough to race to a century in his fourth ODI, against Zimbabwe, still aged 17. He started 2014 as part of the Afghanistan Under-19 team that defeated Australia and Sri Lanka in the Under-19 World Cup, and ended it as a member of the squad for Afghanistan's first full World Cup campaign."
  },
  {
    "name": "Rashid Khan",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Bowling Allrounder",
    "description": "Rashid Khan player profileRashid Khan has been Afghanistan's first global superstar, and the key to their successes in their early years in international cricket. His extraordinarily effective legspin has made him one of the greatest T20 bowlers ever, among the first names on wishlists of teams in leagues all around the world. Not a big turner of the ball, he puts batters under pressure with his speed through the air, like his bowling idol Shahid Afridi, while maintaining a stump-to-stump line."
  },
  {
    "name": "Rahmanullah Gurbaz",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Wicketkeeper Batter",
    "description": " Rahmanullah Gurbaz player profile Fast behind the stumps and explosive in front of them, Rahmanullah Gurbaz had a fast ascent to becoming one of the first names on the Afghanistan team sheet.Having impressed from a young age, he made his List A debut in 2017 at the age of 15 for Afghanistan A against Zimbabwe A, shortly before his first T20 match in the Shpageeza T20 league. The next year saw him make his First Class debut for Mis Ainak region and he was picked in Afghanistan's squad for the 2018 Under-19 World Cup."
  },
  {
    "name": "Mohammad Saleem",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Mujeeb Ur Rahman",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Bowler",
    "description": "Offspinner Mujeeb ur Rahman has followed in the footsteps of his superstar compatriot Rashid Khan, mixing up offbreaks with legspin and ripping googlies and making a splash in T20 leagues around the world.At 16, Mujeeb was part of an Afghanistan Under-19 side that dismantled Bangladesh 3-1 away in 2017. Bowling predominantly with the new ball, he took eight wickets in the first three games of that series and 7 for 19 in the fourth, where Afghanistan successfully defended 134."
  },
  {
    "name": "Mohammad Nabi",
    "team": "Afghanistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "Mohammad Nabi hails from a well-to-do family that moved to Peshawar in Pakistan, seeking a safe haven from the Soviet War in Afghanistan. An efficient allrounder - a strong middle-order batsman who can bowl flighted offspin - Nabi's rise, like Afghanistan's, has been staggering. He has been at the centre of the side since their time in the ICC's World Cricket League Division Five, from where Afghanistan began their rise to the international stage."
  },
  {
    "name": "Hazratullah Zazai",
    "team": "Afghanistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Opening Batter",
    "description": "Afghanistan's ascent up the global rankings from ICC Associate nation to Full Member and Test status has been largely propelled by a conveyor belt of fast bowling and mystery spin. But the country has struggled to unearth quality batting prospects at the same rate as their bowling unit. The emergence of the hard-hitting Hazratullah Zazai is a sign that this may change early in the country's Full Member era."
  },
  {
    "name": "Matthew Wade",
    "team": "Australia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Wicketkeeper Batter",
    "description": "It has been a career of reinvention for Matthew Wade, who went from Test wicketkeeper to specialist middle-order batter to T20I World Cup-winning wicketkeeper-finisher, via a prolific run in domestic cricket when it appeared his international days were over.Wade was a talented junior footballer, but at 170cm decided he was too short to make a career out of it and pursued cricket instead. It wasn't plain sailing: that he played any international cricket at all is a credit to his mental toughness - at 16, he was diagnosed with testicular cancer, and required two cycles of chemotherapy to defeat the illness."
  },
  {
    "name": "Josh Hazlewood",
    "team": "Australia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "A tall and accurate fast bowler who is unrelenting in his line and length, Josh Hazlewood became a fixture in Australia's Test attack as soon as he made his debut in December 2014 and has gone on to enjoy success across all formats. Although he was only 23 at the time, the baggy green had felt a long time coming, given that Hazlewood had been highly regarded for so long.  At 17, he had become the youngest fast bowler to be selected by New South Wales, and at 19 he was in his first one-day international against England at Southampton, joining Craig McDermott and Ray Bright as the only Australian 19-year-olds to play the format so soon."
  },
  {
    "name": "Mitchell Starc",
    "team": "Australia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast",
    "playingRole": "Bowler",
    "description": "Mitchell Starc player profileFirst there was Johnson, then there was Starc. A left-armer called Mitchell has been a staple of Australia's attack for more than a decade and Starc will go down as one of the country's finest all-format bowlers. While Johnson was more express, Starc is still quick enough to make life uncomfortable for opposition batsmen, especially with the bounce gained from his 1."
  },
  {
    "name": "Glenn Maxwell",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": "One of the fastest scorers in world cricket, Glenn Maxwell has lit up the limited-overs formats. His ability to make unconventional shots - reverse sweeps and pulls, for example - appear routine makes it hard to set fields to cover all of his scoring areas. Maxwell's audacity comes with risk, and he can exasperate as well as exhilarate, but at his best he can change a game in moments."
  },
  {
    "name": "Adam Zampa",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Bowler",
    "description": "Adam Zampa has developed into Australia's leading white-ball spinner, and only behind Shane Warne to have done the role in the limited-overs formats. An energetic and competitive legspinner, Zampa emerged in Australia's limited-overs squads in 2016 after a successful summer for South Australia and the Melbourne Stars. He has subtle changes of pace and variations, including a wrong'un (a classic of which dismissed Kane Williamson at the SCG just days before the Covid lockdowns) and straight ball making up for a lack of prodigious turn."
  },
  {
    "name": "Marcus Stoinis",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Batting Allrounder",
    "description": "Marcus Stoinis player profileA powerful, versatile batter and medium-pace bowler, Marcus Stoinis has been a mainstay in Australia's limited-overs sides, a dominant presence in the BBL, and a sought-after IPL performer. Stoinis debuted for his home state, Western Australia, at 19, but found opportunities limited there and moved to Victoria, where he got a run in their Sheffield Shield side in 2013-14 and produced an outstanding 170 against Tasmania, a breakthrough innings that led to him becoming a regular in the top order. Stoinis was Victoria's leading run-scorer in the 2014-15 Sheffield Shield season and was called up to Australia's squad for limited-overs matches against England in 2015, where he debuted, playing an ODI and a T20I."
  },
  {
    "name": "Cameron Green",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Batting Allrounder",
    "description": "Cameron Green was earmarked as an international cricket from very early. Contracted to Western Australia as a schoolboy, he took 5 for 24 on first-class debut against Tasmania in February 2017 as a 17-year-old. He was selected initially for his bowling given his 200cm frame and his ability to deliver fast outswing but was plagued by stress fractures."
  },
  {
    "name": "Ashton Agar",
    "team": "Australia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "Ashton Agar initially turned almost as many heads as he has turned cricket balls. At the age of 19 he had a place in the squads of Western Australia, Perth Scorchers, and the national team, having sensationally been upgraded from an internship on the 2013 tour of India to a more expansive role in Michael Clarke's squad. Agar's rapid rise continued when he made an unforgettable debut in the Ashes Test at Trent Bridge in 2013."
  },
  {
    "name": "Aaron Finch",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Top order Batter",
    "description": "A solidly built, aggressive batter from a country town in Victoria, Aaron Finch ascended to become Australia's ODI and T20I captain, leading his country to their first T20 World Cup triumph in 2021. Finch has twice held the record for the highest score in a T20I: his 172 against Zimbabwe in 2018, surpassed the 156 against England in 2013. In 2014, Finch was named Australia's T20I captain, replacing George Bailey, but on the eve of the 2016 T20 World Cup in India, the selectors decided to consolidate the captaincy of all three formats and handed the job to Steven Smith."
  },
  {
    "name": "Josh Inglis",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Wicketkeeper-batter Josh Inglis, who was born in Leeds before relocating to Australia as a 14-year-old, moved into the national reckoning after finding his feet for both Western Australia and Perth Scorchers. A versatile and hard-hitting batter, he enjoyed a breakthrough Sheffield Shield season in 2020-21 with 585 runs including his first three first-class hundreds having previously churned out runs at grade level without quite making the step up. That followed consecutive 400-plus run seasons for Scorchers in the BBL - where his adaptability at moving from the top order to the middle was noted by selectors - and having continued to flay runs in county cricket for Leicestershire he was named in Australia's 2021 T20 World Cup despite not being part of any of the previous series."
  },
  {
    "name": "Tim David",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Tim David player profileMumbai Indians' decision to sign Tim David for INR 8.25 crore (AUD 1.5 million) at the 2022 IPL auction confirmed two things."
  },
  {
    "name": "Mitchell Marsh",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Allrounder",
    "description": "Mitchell Marsh player profileMitchell Marsh, one of the most well-known surnames in Australian cricket, had been an alluring prospect for many years but struggled to cement a place across formats. However, that has changed in recent years, starting in T20 and then taking in ODIs and, perhaps most significantly, Test cricket.The first of the breakthroughs came when he was elevated to No."
  },
  {
    "name": "Kane Richardson",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "A pace bowler who has often been on the fringes of Australia's ODI and T20 teams, Kane Richardson is know for his skills at the death and has an excellent yorker. Although he has struggled to gain much traction at first-class level for South Australia, Richardson is very effective in the shorter forms and in 2019 was a late addition to the World Cup squad.He has been with three IPL franchises, starting with a USD700,000 deal from the Pune Warriors in 2013 although he only played three matches for them."
  },
  {
    "name": "Pat Cummins",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Pat Cummins player profileEarmarked as a potential star from a young age, Pat Cummins made his Test debut as an 18-year-old but had to wait six years for his next appearance as injuries struck a body that could not withstand the workload. The bowler who emerged in 2017 was a thoroughbred quick who became one of the standout players in the world and, in late 2021, Australia's Test captain in dramatic circumstances. By 2023 he had led the team to the World Test Championship and ODI World Cup."
  },
  {
    "name": "David Warner",
    "team": "Australia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Opening Batter",
    "description": "David Warner's extraordinary batting feats in all three formats for Australia will forever be overshadowed by his role as the chief protagonist of the Newlands ball-tampering scandal of 2018 and his place as a central figure in Australian cricket's ensuing cultural crisis.After he was charged as the man who instructed team-mate Cameron Bancroft to use sandpaper on the ball in the infamous Cape Town Test, Warner, though not punished by the ICC, was banned from international and Australian domestic cricket by Cricket Australia for 12 months, stripped of the vice-captaincy, and banned from leadership roles for life.He returned for the 2019 World Cup and enjoyed a prolific tournament before suffering a record-breakingly poor Ashes, in which he made 95 runs in ten innings."
  },
  {
    "name": "Steven Smith",
    "team": "Australia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Top order Batter",
    "description": "In a career of twists and turns, Steven Smith started out as a legspinner and become Australia's best batter since Sir Donald Bradman, either side of having his career derailed by a ball-tampering scandal that saw him stripped of the captaincy and banned for 12 months.The rise from that controversy at Newlands in 2018 was near-miraculous: Smith returned to Test cricket with a 774-run Ashes series in 2019, and pictures of him in tears at Sydney airport after his return in disgrace from South Africa were replaced in the popular memory with those of triumphant celebrations of centuries. Part of his punishment for Cape Town was being banned from any leadership position for two years, but once he served that penance, in late 2021 he was named Pat Cummins' vice-captain and a few weeks later led the side against England when Cummins was ruled out of a Test by Covid."
  },
  {
    "name": "Ebadot Hossain",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Ebadat Hossain Chowdhury's journey from being a volleyball player for Bangladesh Air Force to becoming a Test cricketer in February 2019 was a short, and interesting, one. Living in their barracks, Ebadat dreamt of bowling like Brett Lee one day. His dream came true when he took part in the 2016 Robi Pacer Hunt in Faridpur, crisscrossing 342km southwest from his hometown Sylhet."
  },
  {
    "name": "Shakib Al Hasan",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": "Easily the finest player Bangladesh have produced, Shakib Al Hasan is a canny, consistent and accurate bowler and an aggressive batter with a wide range of strokes in his repertoire. He has spent long periods at the top of the ICC's allrounder rankings across formats, a validation of his stature in the game.In 2008, in his seventh Test, Shakib made 71 and took 7 for 36 in Chittagong against New Zealand, only the second instance of a Bangladesh bowler taking as many wickets in a Test innings."
  },
  {
    "name": "Taskin Ahmed",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Taskin Ahmed is regarded as the leader of Bangladesh's fast bowling attack in the post-Mashrafe Mortaza period. He has had two phases of his international career after injuries and poor form forced him into the wilderness for three years. He was a firebrand in the first phase, often erratic in line and length."
  },
  {
    "name": "Afif Hossain",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "Bangladesh left-hander Afif Hossain made his T20I debut in 2017 and impressed right away in his second game with a 26-ball 52 at No. 8 in a narrow win over Zimbabwe. He took a while to get going after that, although his T20I captain Mahmudullah praised his maturity during a tricky innings on a turning Mirpur pitch."
  },
  {
    "name": "Nurul Hasan",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Nurul Hasan, who made his first-class debut in 2011, is one of a whole host of talented Bangladesh wicketkeepers who had to wait his turn to play international cricket. It wasn't entirely his fault though. For 30 years, the position behind the stumps was the domain of Khaled Mashud or Mushfiqur Rahim."
  },
  {
    "name": "Yasir Ali",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "An aggressive middle-order batter, Yasir Ali made meaningful contributions in two iconic overseas wins for Bangladesh, but a lack of big scores left him in the lurch less than two years after his international debut in 2021.Born and raised in Chattogram, Yasir travelled the age-group route in Bangladesh, and became a regular in first-class and one-day cricket. He did his time on the domestic circuit before the national selectors started picking him in Bangladesh squads after the Covid-19 pandemic."
  },
  {
    "name": "Najmul Hossain Shanto",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "Although he made his debut in 2017, and scored two Test hundreds in 2021, it took Najmul Hossain Shanto more than five years to truly establish himself in the Bangladesh side. But once he did, he was rewarded by being appointed Bangladesh's captain in all three formats. The turnaround in his form came at the 2022 T20 World Cup."
  },
  {
    "name": "Hasan Mahmud",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Hasan Mahmud is one among a group of young pace bowlers who have given hope of a fast bowling uprising in Bangladesh, after decades of reliance on spin. Mahmud is still at a very early stage of his career, having just played a single T20I for Bangladesh, and earned a maiden call-up in the ODI side in January 2021, but already he has earned plenty of praise from Bangladesh's coaches for his ability to bowl fast, full and accurately. Mahmud is also one of the rarities in Bangladesh cricket, in that he is also a very good outfielder among the pace bowlers."
  },
  {
    "name": "Shoriful Islam",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "At 6ft three inches, Shoriful Islam became a left-arm pace sensation almost overnight, when he starred in Bangladesh's 2020 Under-19 World Cup triumph. He took nine wickets, but it was his aggression and pace in the knockout games against South Africa, New Zealand and (in the final against) India that stood out.They returned home in February to much adulation and many prizes, but shortly afterwards got stuck at home by the Covid-19 pandemic."
  },
  {
    "name": "Mehidy Hasan Miraz",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "Mehedi Hasan Miraz has emerged as one of the brightest young stars in Bangladesh cricket. He led the country to their first appearance in an Under-19 World Cup semi-final in February 2016, before making the year more memorable with his Test debut, against England in October.He is a batting allrounder who bowls right-arm offspin with a quiet action where he trundles to the wicket before giving a slight leap before rotating his upper body."
  },
  {
    "name": "Mosaddek Hossain",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Mosaddek Hossain, who comes from a family of cricketers, snuck up on Bangladesh cricket's consciousness during the 2013 Dhaka Premier Division Cricket League, helping Abahani Limited stay afloat in a disastrous campaign. He struck a century and three fifties, before having to head to the Bangladesh Under-19 training camp ahead of the 2014 World Cup in the UAE. The opportunity to get out of age-group cricket quite early proved to be an important milestone in his development."
  },
  {
    "name": "Litton Das",
    "team": "Bangladesh",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "Litton Das made his way into the Bangladesh senior sides following his exploits for Abahani in the Dhaka Premier League, and Rangpur Division in the National Cricket League in 2014-15, where he was the top scorer. Perhaps the first wicketkeeper-batter in the country good enough to be seen as a long-term successor to Mushfiqur Rahim, he emerged from the northern district of Dinajpur, around 330km from the capital, Dhaka, beginning his adolescent life as a young cricketer at the Bangladesh Krira Shikkha Protishtan and impressing with his heavy run-scoring in schools and age-group cricket. Litton was picked in Bangladesh's Under-19 side in 2012, the year after he made his first-class debut, and over two U-19 World Cups, that year and in 2014, he cumulatively averaged over 50, with a century and three fifties."
  },
  {
    "name": "Mustafizur Rahman",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "Mustafizur Rahman is a left-arm pace bowler who came to Dhaka to try out for a fast-bowling camp in 2012, after he had impressed in an Under-17 tournament in Satkhira, some 300km from Dhaka. He got admitted to the BCB's pace foundation and soon caught the coaches' attention to make the Bangladesh Under-19 side for the 2014 World Cup. He made his first-class debut for Khulna in the 2013-14 season and, after taking eight wickets in the U-19 World Cup in the UAE, he was surprisingly picked for Bangladesh A's tour of West Indies."
  },
  {
    "name": "Nasum Ahmed",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Soumya Sarkar",
    "team": "Bangladesh",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Batting Allrounder",
    "description": "A rarity among Bangladesh allrounders, top-order batter Soumya Sarkar bowls medium pace rather than spin, and occasionally even takes the new ball. Like many top-level Bangladesh players, Soumya is an alumnus of the Bangladesh Krira Shikkha Protishtan (BKSP) in Dhaka. He played a game in the 2010 Under-19 World Cup and two years later found himself with the national side in Australia, though he also went on to play the following U-19 World Cup."
  },
  {
    "name": "Jos Buttler",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Jos Buttler player profileEngland have had many players down the ages who have gained world acclaim, but Jos Buttler is arguably their first global Twenty20 superstar. Buttler helped bring England's limited-overs batting into the 21st century, his impact on the one-day and T20 sides extraordinary as they turned a group-stage exit in the 2015 World Cup into a triumph on home soil four years later, with his efforts with the bat and the gloves crucial to their Super-Over victory in the final. In an 18-month period from mid-2014, he scored what at the time were England's three fastest one-day hundreds - thrilling innings against Sri Lanka at Lord's, New Zealand at Edgbaston and, topping the list, a 46-ball onslaught against Pakistan in Dubai."
  },
  {
    "name": "Jonny Bairstow",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Wicketkeeper Batter",
    "description": "Jonny Bairstow player profileJonny Bairstow, the son of the former England wicketkeeper David Bairstow, is a combative wicketkeeper-batter who has become a cricketer to be reckoned with in England's middle order. The journey was far from easy for Bairstow, especially with Jos Buttler in contention for the gloves, but prolific run-making for Yorkshire eventually made a case that England's selectors could not ignore. Galvanised by his selection, runs flowed."
  },
  {
    "name": "Chris Jordan",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Chris Jordan, a fast bowler with a level-headed calmness and a fearsome yorker, found his niche as a death specialist in T20 cricket for England after initially breaking through as a bowling allrounder in Tests and ODIs. Jordan's career looked to be going nowhere at the end of 2012 when he was released by Surrey, but he made his international debut less than a year later. He enjoyed a run in England's white-ball sides in the games following the 2013-14 Ashes tour, and was given a Test debut the following summer."
  },
  {
    "name": "Moeen Ali",
    "team": "England",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": "Moeen Ali was tipped for the top long before he won his Test debut at the start of 2014. But, after building a reputation as an elegant batter, it was his offspin bowling that earned him the call-up when England were left reeling from the surprise retirement of Graeme Swann.While many critics dismissed him as a \"part-time\" bowler, Moeen had a record to compare with the best in county cricket over recent seasons."
  },
  {
    "name": "Dawid Malan",
    "team": "England",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Top order Batter",
    "description": "Dawid Malan made a striking entry into international cricket in a T20I in Cardiff in 2017, demolishing South Africa's attack with 78 from 44 balls. He deposited the second ball, from Chris Morris, over midwicket for six and never looked back.A bludgeoning left-hand batter with power and panache, Malan was born in Roehampton but brought up in South Africa."
  },
  {
    "name": "Chris Woakes",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Allrounder",
    "description": "By the time Chris Woakes returned from England's tour to South Africa at the start of 2016, he feared his Test career was over. He was 27 by then and had played six Tests. But, despite bowling respectably on almost every outing, he had never quite made the breakthrough and an average of 63."
  },
  {
    "name": "Mark Wood",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "It looked, for a while, as if Mark Wood would be another of those fast bowlers who promised more than they delivered.An apparently relentless succession of injuries - particularly injuries to his ankle - threatened to either end his career or turn him into another fast medium seamer who compromised his pace for a longer career in the game.But Wood was not to be denied."
  },
  {
    "name": "Harry Brook",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Batter",
    "description": "In the winter of 2022-23, Harry Brook announced himself as one of the world's most exciting young players with a staggering run of form across formats, most particularly in England's rebooted Test team. After making his debut against South Africa in September 2022, Brook travelled to Pakistan and New Zealand with Ben Stokes' team, where he peeled off consecutive scores of 153, 87, 9, 111, 89, 54, and 186 to take his overall tally to 809 runs in nine innings, at an extraordinary strike-rate of 98.77."
  },
  {
    "name": "Ben Stokes",
    "team": "England",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Allrounder",
    "description": "The great Irish sports writer Con Houlihan used to say that every team should have a redhead. And it's true that Ben Stokes' combative nature, allied to his powerful frame and outrageous talent, lifted England to another level. Never was that more true than when he secured his place in English cricket history with an indefatigable batting display in the 2019 World Cup final."
  },
  {
    "name": "Phil Salt",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "Phil Salt's fearless ball-striking at the top of the Sussex order earned him attention from across the global T20 circuit and a maiden England call-up in 2019, though he was made to wait until 2021 for his debut when he performed a passable impression of Jason Roy in the Covid-hit ODI series against Pakistan.Born in Wales but raised in Barbados, Salt's interests quickly switched from football to cricket. He had watched Manchester City home and away growing up, but the move to the Caribbean inspired a desire to play cricket, and play it aggressively."
  },
  {
    "name": "Adil Rashid",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": "Adil Rashid did much to set right English cricket's troubled relationship with legspin when he established himself as the country's leading white-ball spinner in 2015 and four years later was a key part of their World Cup-winning side. At the time of Rashid's recall to the limited-overs set-up in 2015, no legspinner had taken more than five white-ball wickets for England; over the next six years, Rashid took more than 200.His success in the limited-overs game owed much to his variation - and his wicked googly in particular - and it was no great surprise when he got his Test debut in 2015 against Pakistan."
  },
  {
    "name": "David Willey",
    "team": "England",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowling Allrounder",
    "description": "Naturally competitive, willing to innovate, capable of changing a game with bat or ball, stunning run-out or implausible catch, David Willey has a lot going for him as a limited-overs cricketer. His attacking approach as a left-arm quick and a clean-hitting batter first won him an international cap against Ireland in 2015 and he was regular member of England's ODI squads through that four-year cycle, but was squeezed out on the eve of the 2019 World Cup by the newly qualified Jofra Archer. The son of former England allrounder turned umpire Peter Willey, David had long been recognised as feisty character on the county circuit before England came calling."
  },
  {
    "name": "Tymal Mills",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast",
    "playingRole": "Bowler",
    "description": "Tymal Mills won an England recall for the 2021 T20 World Cup after four-and-a-half years in the international wilderness, during which time regular injuries had threatened his career. Mills, one of the most explosive fast bowlers in English cricket and an innovative thinker about the short-form game, was diagnosed with a congenital back condition in 2015 - his spinal cord and vertebrae are unusually close together and bowling fast too often can agitate his spinal cord - which consigned him to a career as a T20 specialist but he embraced life on the franchise circuit.Mills only started playing cricket when he was 14 - and it was another two years before it became a serious part of his life - but by the age of 19 had forced his way into the Essex first team, abandoning a journalism cause at the University of East London in the process."
  },
  {
    "name": "Alex Hales",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Opening Batter",
    "description": "Alex Hales' central role in England's T20 World Cup win in 2022 ensured he would be remembered for what he achieved, rather than what he missed. Three years earlier, Hales had watched England lift the 50-over World Cup from his sofa; he was dropped a month before the tournament after news of a failed recreational drugs test broke in the media, prompting what Eoin Morgan described as \"a complete breakdown in trust\" between him and his team-mates.He did not play for England again under Morgan's leadership and was initially left out of their squad for the 2022 T20 World Cup."
  },
  {
    "name": "Reece Topley",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "A left-arm seamer with a fearsome yorker but a chequered injury history, Reece Topley's career was in peril before his 25th birthday as he suffered a series of stress fractures that left him wondering whether he would ever be able to play again.That four years on Topley is regarded as a vital part of England's white ball plans, as a left-armer who deliveries from a great height, speaks of his mental fortitude. In 2022, he grew in both white ball codes at international level, registering the best ODI figures for an Englishman with 6 for 34 against India at Lord's."
  },
  {
    "name": "Sam Curran",
    "team": "England",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Allrounder",
    "description": "Sam Curran, younger brother of Tom Curran, his fellow Surrey all-rounder, and son of the former Zimbabwe cricketer Kevin Curran, fulfilled his destiny at the age of 19 years and 363 days, when he made his Test debut against Pakistan at Headingley in June 2018. One Test later, he scooped his maiden Man-of-the-Match award, after four first-innings wickets and a thrilling counter-attacking half-century had given England the edge in a gripping Edgbaston Test against India. His success merely heightened the debate as to whether batting or bowling will ultimately become his strongest suit."
  },
  {
    "name": "Liam Livingstone",
    "team": "England",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak, Legbreak",
    "playingRole": "Batting Allrounder",
    "description": "Liam Livingstone broke into the spotlight when he made a T20I hundred off 42 balls against Pakistan in 2021 - the fastest century in the format by an England player. By then he had a reputation in English cricket as a batter equipped with plenty of raw power and the ability to dismantle good bowling attacks, a sharp outfielder, and a useful spinner who could turn the ball either way.Livingstone first attracted attention when he creamed 350 in 138 balls for club side Nantwich in 2015 - one of the largest individual scores in any officially sanctioned limited-overs game."
  },
  {
    "name": "Virat Kohli",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Top order Batter",
    "description": "Virat Kohli player profileIndia has given to the world many a great cricketer but perhaps none as ambitious as Virat Kohli. To meet his ambition, Kohli employed the technical assiduousness of Sachin Tendulkar and fitness that was in the league of top athletes in the world, not just cricketers. As a result, Kohli became the most consistent all-format accumulator of his time, making jaw-dropping chases look easy, and finding, in his own words, the safest possible way to score runs."
  },
  {
    "name": "Bhuvneshwar Kumar",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Bowler",
    "description": "At the time of his India debut in 2012, Bhuvneshwar Kumar seemed the answer to the side's fast-bowling scarcity; though middling in pace, he produced swing both ways and had a devastating inswinger. In his first T20I over, he bowled Nasir Jamshed; with his first ODI delivery, he bowled Mohammad Hafeez; and in his first Test series he played a part in India's first whitewash win in a four-Test series, against Australia in 2013. Bhuvneshwar demonstrated his mastery of line and length early, when at 19 he worked Sachin Tendulkar over for his first duck in domestic first-class cricket, in the 2008-09 Ranji Trophy final."
  },
  {
    "name": "Jasprit Bumrah",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Jasprit Bumrah player profileJasprit Bumrah grabbed eyeballs first with his unorthodox action, and then his bowling skills. Armed with an anomalous, sling-arm action and natural pace, the peculiar release point of Bumrah's deliveries makes it hard for batsmen to pick him. Besides, like his Mumbai Indians team-mate, Lasith Malinga, Bumrah carved himself a reputation for possessing an uncanny ability to hit the blockhole."
  },
  {
    "name": "Yuzvendra Chahal",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Bowler",
    "description": "Yuzvendra Chahal player profileYuzvendra Chahal is an attacking legspinner who first attracted attention when he took 34 wickets in the National Under-19 Cooch Behar Trophy in 2009, ending the tournament as its leading wicket-taker. A former chess player who represented India at junior levels, Chahal made his first-class debut for Haryana the same year and was signed by Mumbai Indians in 2011 to be part of their IPL squad. He didn't play a game that season but was still named in Mumbai's Champions League T20 squad the same year."
  },
  {
    "name": "Mohammed Shami",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Mohammed Shami was India's leading fast bowler in the 2015 World Cup in Australia, when the team marched into the semi-finals and picked up 77 out of 80 wickets on offer. It was later revealed that he had played through that entire tournament - and the preceding Test series against the hosts, essentially four months - through a knee injury. His success can be attributed to his pace, accuracy and primarily his skill in moving the ball - both old and new."
  },
  {
    "name": "Deepak Hooda",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "An allrounder who can bat in any position, Deepak Hooda also bowls offbreaks, offers plenty of athleticism as a boundary fielder, and is an asset in any T20 side. His big hitting as a 19-year-old in his debut IPL season, in 2015, earned with the nickname \"Hurricane Hooda\", but more importantly, got him a Rs 4.2 crore (US$ 622,000 approx) contract with Sunrisers Hyderabad at the next auction."
  },
  {
    "name": "Rohit Sharma",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "Rohit Sharma player profileLanguid and easy on the eye, Rohit Sharma owned all the shots in the book when he emerged from the Mumbai suburbs as heir apparent to the Indian batting greats of the 2000s. It took him time and persistence, but by the 2010s he had become a colossus in white-ball cricket, and the man in charge of perhaps the most formidable league team in the first age of T20.That Rohit had talent was apparent to both the casual observer and to the trained eye."
  },
  {
    "name": "Arshdeep Singh",
    "team": "India",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Bowler",
    "description": "Arshdeep Singh player profileArshdeep is one of only three Indian bowlers, after Jhulan Goswami and Ajit Agarkar, to start his T20I career with a maiden over. A death-overs specialist known for his accurate yorkers and 140kph-plus deliveries, he made his international debut in England in 2022.That debut, though, was several years in the making."
  },
  {
    "name": "Axar Patel",
    "team": "India",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": " Axar Patel player profile Left-arm spinner Axar Patel has been increasingly handy with the bat in the lower order across formats - enough to be classified as a bowling allrounder. He played just one first-class game in his debut season for Gujarat, but had a more successful showing in 2013, when he was one of the key contributors to India Under-23s' title win in the ACC Emerging Teams Cup, with seven wickets, including a four-for in the semi-final against UAE. He was consistent for Gujarat with bat and ball in the Ranji Trophy that season, finishing with 369 runs at an average of 46."
  },
  {
    "name": "Kl Rahul",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "KL Rahul player profileA tall, elegant right-hand batter who can keep wicket in a crisis, KL Rahul is among the most highly rated opening batters in India's next generation. Rahul was a part of India's squad in the 2010 Under-19 World Cup and made his first-class debut later that year. Having taken a while to establish himself as a first-class cricketer, he enjoyed a breakthrough 2013-14 season, laying the foundation for Karnataka's Ranji Trophy victory with 1033 runs, which included three centuries, three nineties, and a Man-of-the-Match performance in the final."
  },
  {
    "name": "Rishabh Pant",
    "team": "India",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Rishabh Pant player profileA match-turning, swashbuckling batter-keeper in the Adam Gilchrist mould, Rishabh Pant has had a starring role in more than a handful of India's biggest Test matches in his first few years in the team.His first Test century came in his third match, on the 2018 tour of England, when he made 114 from No. 7 when up against a target of 464 that he made look almost gettable at points when he was at the crease."
  },
  {
    "name": "Ravichandran Ashwin",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Bowling Allrounder",
    "description": "R Ashwin player profileR Ashwin took the tricks and skills he learned playing tennis-ball cricket on the streets of Chennai, particularly the soduku ball, a finger-flicked legbreak, to Test cricket, where he became perhaps the leading offspinner of the first quarter of the 21st century.All through his career Ashwin has been a cricket nerd with a deep appreciation of the nuances of the game and an acute knowledge of his craft. And it was that sharp brain, along with the carrom ball, an equally good arm ball, and masterly control over his offbreaks that made him a quintessential limited-overs spinner early in his career."
  },
  {
    "name": "Hardik Pandya",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Allrounder",
    "description": "Hardik Pandya player profileAllrounder Hardik Pandya's calling cards brisk seam bowling and powerful ball-striking marked by the ability to hit sixes from the first ball. Hardik, who plays his domestic cricket for Baroda, first caught the eye with an unbeaten 31-ball 61 for Mumbai Indians against Kolkata Knight Riders in the 2015 IPL. That began a long association with Mumbai, where he won four trophies and gained acclaim as a formidable finisher."
  },
  {
    "name": "Suryakumar Yadav",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium, Right arm Offbreak",
    "playingRole": "Batter",
    "description": "Suryakumar Yadav player profileHard-hitting 360-degree batter Suryakumar Yadav has all the shots, including a few not in any textbook save the one written by AB de Villiers. He also has a yen for making batting look easy, as he showed during four golden years with Mumbai Indians starting in 2018, during which they won the IPL title twice, thanks in no small part to his 1700-plus runs at a strike rate of around 140.He made 73 on his Ranji Trophy debut, for Mumbai in 2010, and the following season scored 754 from nine games, the most by anyone from his team."
  },
  {
    "name": "Dinesh Karthik",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "Not many would forget the sight of Dinesh Karthik in India colours, horizontal on the ground, as he stumped Michael Vaughan in 2004. It was his first dismissal as a wicketkeeper for India, but his international career never really took off. Around the time he began churning out consistent runs in domestic cricket, India had MS Dhoni at the helm and behind the stumps, so there was very little Karthik could do."
  },
  {
    "name": "Harshal Patel",
    "team": "India",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Bowler",
    "description": "Harshal Patel IPL factfile- After a slow start to his IPL career, Harshal Patel rose to prominence in 2021 when he equalled the record for most wickets in a season (32).- He is best known for his slower balls, particularly one that dips on the batter.- He has played for Royal Challengers Bengaluru with great success but now plays for Punjab Kings, who bought him for INR 11."
  },
  {
    "name": "Barry Mccarthy",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Barry McCarthy is an Ireland seam bowler whose involvement with Durham owed much to a recommendation by their England allrounder, Ben Stokes, who faced him in the nets before a one-day international and advised his county to take a look. Durham did just that and McCarthy made his first-class debut in 2015. A maiden five-wicket haul for Durham against Lancashire in Chester-le-Street the following year added to the good impression he had built at Ireland Under-19 level and during a spell with the Australian grade side Randwick-Petersham."
  },
  {
    "name": "Mark Adair",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowling Allrounder",
    "description": "Mark Adair is a tall, seam-bowling allrounder from Northern Ireland who made his first-class debut for Warwickshire while still a teenager at the end of the 2015 season. From a sporting family - his father was a goalkeeper at a decent level and his brother plays rugby and represented Ireland at cricket at age-group level - Adair also showed promise in rugby but committed to cricket having been offered a trial by Warwickshire in 2013. He has represented Ireland at age-group and A team level and claimed the wicket of Marcus Trescothick as his maiden victim in first-class cricket."
  },
  {
    "name": "Fionn Hand",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Lorcan Tucker",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Wicketkeeper-batter Lorcan Tucker, who was among Ireland's first batch of contracted cricketers, made his international debut in 2016, before he played his first first-class game the following year.  His father and brothers also played the game; Tucker and his younger brother Fiachra both figured in the 2016 Ireland Under-19 World Cup squad.Tucker's first international fifty came in 2019, against Zimbabwe in an ODI home series where Ireland whitewashed the visitors."
  },
  {
    "name": "Josh Little",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "A bustling left-arm seamer from Dublin, Josh Little made an immediate impression on ODI debut against England in 2019 when he took 4 for 45 - including the wicket of Eoin Morgan with a sharp bouncer - to leave the world's No. 1-ranked side struggling in an ultimately successful run chase.Little had made his T20I debut two months short of his 17th birthday back in 2016, but found himself balancing academic commitments with cricket in the first two years of his career, limiting his availability."
  },
  {
    "name": "Craig Young",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "One of a number of players to emerge out of Ireland's robust Under-19 squads from the early 2010s, Craig Young became the ninth bowler to take a five-for on men's ODI debut when he demolished Scotland in Malahide in September 2014. It was a well-timed performance for Young, considering he had just lost his county contract with Sussex and parlayed that into a Cricket Ireland central contract. Before long, Young was drawing comparisons with Boyd Rankin, not just because of his threatening pace and bounce but also his Londonderry roots."
  },
  {
    "name": "George Dockrell",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": "Left-arm spinner George Dockrell made his international debut for Ireland as a 17-year-old in 2010 though he had been bowling spin for only four years at that point, after coach Brian O'Rourke spotted him having a bowl in a car park during an Ireland age-group tour of Wales. Dockrell played a key role in Ireland's 2010 T20 World Cup campaign, seeing off Netherlands in the qualifying tournament before taking 3 for 16 against West Indies and choking England's middle order with four overs for 19 runs. School exams then prevented him facing Australia in an ODI but a month later he was offered a contract at Somerset."
  },
  {
    "name": "Gareth Delany",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Batting Allrounder",
    "description": []
  },
  {
    "name": "Curtis Campher",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Allrounder",
    "description": "Born in Johannesburg, raised in South Africa and a player for the national Under-19 side, Curtis Campher decided to leave his homeland behind and put his Irish passport to good use in early 2020, declaring his intentions to move to Ireland and play for the national team. He went on the Ireland Wolves' tour to Namibia early that year, and impressed sufficiently to win a place in the squad for a three-match ODI series in England in July.Thrown straight into the side, Campher made half-centuries in his first two international innings, and dismissed Tom Banton with his fourth ball on debut - whom he had previously trapped lbw while playing against him for South Africa U-19s."
  },
  {
    "name": "Paul Stirling",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": "Paul Stirling has long been recognised as a formidable cricketing talent both in Ireland and beyond. Before his 23rd birthday, he had already hit two ODI centuries against Pakistan. With a natural swagger and belligerence allied to a portly build, Stirling has evoked comparisons with Jesse Ryder."
  },
  {
    "name": "Conor Olphert",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Graham Hume",
    "team": "Ireland",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Graham Hume is a left-hand batsman and right-arm medium pacer who compares his style to South African fast bowler Charl Langeveldt but whose hero is AB de Villiers. He was named in South Africa's squad for the Under-19 World Cup in New Zealand in January 2010 and he was his team's leading wicket-taker with 13 wickets. Cricinfo staff January 2010\n."
  },
  {
    "name": "Harry Tector",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Born into a cricketing family - his brothers Jack and Tim also captained Ireland at U19 World Cups - Harry Tector has quietly amassed an impressive record in the senior side since cementing a spot in the post-Covid era. Playing in just his third ODI, in 2020, Tector produced an ice-cool 29 not out off 26 balls to help secure a famous win chasing 329 with a ball to spare. Paul Stirling's and Andy Balbirnie's hundreds may have taken the headlines on the day, but Tector's poise gave hope that Ireland may have found a cure for the middle-order ills that had plagued them following multiple retirements toward the end of the 2010s."
  },
  {
    "name": "Andy Balbirnie",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batter",
    "description": "Already one of Ireland's star batters at No. 3, Andrew Balbirnie flourished with the bat even more after he was made captain across formats late in 2019. Although not a power-hitter, Balbirnie is fluent, keeps the score ticking, and is excellent against spin bowling - his hard sweep is a signature shot."
  },
  {
    "name": "Simi Singh",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak, Legbreak Googly",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Stephen Doheny",
    "team": "Ireland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "David Wiese",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Allrounder",
    "description": "David Wiese joined a marked outflow of South Africa players into county cricket in the 2016-17 season when, at 31, he signed a three-year deal with Sussex, joining his compatriot Stiaan van Zyl. Wiese had not played international cricket since March 2016, and turned down a call-up for a home T20I series against Sri Lanka in making his decision to go Kolpak. Five years later he became eligible to play for Namibia based on ancestry."
  },
  {
    "name": "Jan Nicol Loftie Eaton",
    "team": "Namibia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium, Legbreak",
    "playingRole": "Batting Allrounder",
    "description": []
  },
  {
    "name": "Divan La Cock",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Jan Frylinck",
    "team": "Namibia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Karl Birkenstock",
    "team": "Namibia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Middle order Batter",
    "description": []
  },
  {
    "name": "Pikky Ya France",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Called up to the Namibia Under-19 squad for the first time in 2007, Pikky Ya France played in the opening two games of the African Under-19 Championships but was then dropped. He had problems with his line when bowling and conceded nine wides in five overs. Neverthelss, he was part of the squad for the Under-19 World Cup in 2008 and eventually got his chance with the seniors against Gauteng in the 2010-11 CSA Provincial Three-Day Competition."
  },
  {
    "name": "Jj Smit",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Bernard Scholtz",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "Bernard Scholtz's brother Nicolaas is currently playing for the national side, but Bernard has his chance to impress at the forthcoming Under-19 World Cup in Malaysia. His aim, he says, is \"to compete against the top teams of the world and get exposure to a higher level of cricket\". And that goal moved a step closer in 2008 when he was named in the squad to face Bermuda in the Intercontinental Cup."
  },
  {
    "name": "Ben Shikongo",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Ruben Trumpelmann",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Zane Green",
    "team": "Namibia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": []
  },
  {
    "name": "Michael Van Lingen",
    "team": "Namibia",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Medium, Slow Left arm Orthodox",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Tangeni Lungameni",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Lo Handre Louwrens",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": []
  },
  {
    "name": "Stephan Baard",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Batter",
    "description": []
  },
  {
    "name": "Gerhard Erasmus",
    "team": "Namibia",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Teja Nidamanuru",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Max O Dowd",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Bas De Leede",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Batting Allrounder",
    "description": []
  },
  {
    "name": "Tom Cooper",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "An aggressive batsman who was born in Wollongong, in New South Wales - the\nsame coastal city which produced Brett Lee - Tom Cooper now plays his club\ncricket for University in Adelaide. An Australian Under-19 representative - he made 104 against South Africa in the 2005-06 Youth World Cup - Cooper broke into the senior South Australian side in November 2008.His early successes came in limited-overs games, starting with 53 in his first one, against Western Australia at Adelaide Oval, and a month later he hit 101 against New South Wales at the SCG."
  },
  {
    "name": "Timm Van Der Gugten",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Timm van der Gugten, born in Sydney, made his first-class debut for New South Wales in November 2011. He was called up to the Netherlands the following year for World Twenty20 in the West Indies and made his debut at 21. He also represented the Netherlands at two subsequent World Twenty20s where he has carried one of their most potent threats."
  },
  {
    "name": "Vikramjit Singh",
    "team": "Netherlands",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Stephan Myburgh",
    "team": "Netherlands",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Colin Ackermann",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": "Having relinquished his South African qualification to sign a contract with Leicestershire, taking advantage of an EU passport, Colin Ackermann was part of the late-2010s exodus that rocked cricket in his home country. Although less heralded at the time, Ackermann was a former South Africa U-19 who had topped the Sunfoil averages in 2016-17, and might have been in contention for a Test call-up had he not taken the well-trodden English county route.His returns in county cricket were mostly solid rather than spectacular, and when he did grab the headlines it was with his occasional offspin - figures of 7 for 18 in a T20 Blast game against Birmingham Bears making him the first man to take a seven-wicket haul in the format."
  },
  {
    "name": "Roelof Van Der Merwe",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowling Allrounder",
    "description": "A tidy left-arm spinner and hard-hitting batter, Roelof van der Merwe is one of a small set of cricketers to have represented two international teams.Van der Merwe played in the 2004 Under-19 World Cup for South Africa before he made his domestic debut in 2006 for Northerns. He first tasted success in franchise cricket with Titans in the 2007-08 season, when he topped the wicket-takers' chart in the MTN Domestic Championship, finished third in the Standard Bank Pro20 Series, and contributed handy runs in both tournaments."
  },
  {
    "name": "Logan Van Beek",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "Allrounder Logan van Beek came to global attention when he single-handedly ensured West Indies would not make it to the ODI World Cup for the first time in their history. In the Qualifier tournament in Zimbabwe in June 2022, he first lashed 28 off 14 balls to tie the scores in a chase of 374, then smacked three sixes and as many fours off Jason Holder in the Super Over, and sealed the deal with two wickets when West Indies batted.He started out playing for New Zealand, whom he represented in the Under-19 World Cup in 2010, before switching to Netherlands, whom he qualified for because of his Dutch passport courtesy his paternal grandparents, who moved to New Zealand in the 1950s."
  },
  {
    "name": "Tim Pringle",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Shariz Ahmad",
    "team": "Netherlands",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Paul Van Meekeren",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Paul van Meekeren drew attention to himself during the World Twenty20 qualifiers in 2016 when he produced a spell of 4 for 11 against Ireland. A trial match at Taunton Vale, plus the success of his Dutch compatriot Timm van der Gugten at Glamorgan, was enough for Somerset to offer him a short-term deal midway through the 21016 season which they extended to a two-year deal until the end of the 2018 season. He made his Somerset first-class debut against the Pakistan tourists and followed up with T20 and List-A debuts for the Club in the same season, catching the eye in a NatWest T20 Blast fixture at Cardiff where he bowled with genuine pace."
  },
  {
    "name": "Brandon Glover",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "A Dutch-South African fast bowler, Brandon Glover left South Africa after a call from Netherlands coach Ryan Campbell, who convinced him to put his Dutch passport to good use after he had finished his accounting degree. He had played Under-19 cricket for South Africa, but was enticed by the opportunity to play regular international cricket, and starred at the T20 World Cup Qualifier in late 2019, bowling hard lengths into the pitch at high pace.Chris Liddle had worked with the squad as a bowling coach during that competition, and when he earned the same role at Northamptonshire ahead of the 2020 season, Glover arrived shortly after on his recommendation, playing as a local player through the EU settlement scheme."
  },
  {
    "name": "Fred Klaassen",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "Spotted as part of a Netherlands development squad which played two one-day friendlies against Kent in 2018, Fred Klaassen joined the county's Second XI, taking nine wickets in two appearances to earn a two-year deal ahead of the 2019 summer. After an impressive debut season for Kent's first team, Klaassen signed a contract extension to keep him at the club at least until the end of 2021.Klaassen took 21 wickets from 22 appearances across all formats for Kent, his best figures for the club coming in a one-day match against Surrey when he claimed 2 for 17, with 24 dot balls, in 6."
  },
  {
    "name": "Scott Edwards",
    "team": "Netherlands",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Born in Tonga and raised in Australia, Scott Edwards made his Netherlands debut in 2017 and decided to abandon his electrical apprenticeship and commit to Dutch cricket. Five years later, he was established in the side as an innovative middle-order batter and wicketkeeper, and took over the captaincy when Pieter Seelaar retired.Edwards is a dual passport holder thanks to his grandmother's Dutch roots and, as an 18-year-old, he played a season of club cricket for Excelsior in Rotterdam which put him on the Netherlands' radar."
  },
  {
    "name": "Daryl Mitchell",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Batting Allrounder",
    "description": "Daryl Mitchell was called into New Zealand's Test team in late 2019 as a replacement for the injured Colin de Grandhomme. He impressed, making an assured 73 against England in his first innings and bowling with good control on a sluggish surface at his home ground, Hamilton. Mitchell, the son of former New Zealand rugby union player and coach John Mitchell, scored his first Test hundred at the start of 2021, in an innings win over Pakistan in Christchurch, and his first ODI century that March."
  },
  {
    "name": "Trent Boult",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "Rated as one half of the best new-ball pair in New Zealand history by Sir Richard Hadlee, Trent Boult is a left-arm quick who presents a significant threat to batsmen around the world with an ability to move the ball both ways even in unresponsive conditions.Born in the Bay of Plenty region in New Zealand's North Island, Boult is, in the words of his brother Jono, a \"normal sort of Kiwi young guy… into his golf and fishing and surfing.\" Cricket, though, was his calling."
  },
  {
    "name": "Martin Guptill",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Opening Batter",
    "description": "Few players in world cricket play the short-arm pull on one leg with elegance like Martin Guptill. A right-handed opening batsman, Guptill has consistently been among the runs in ODIs notably making a double-century in the quarter-final of the 2015 World Cup, but has struggled to make a mark in Tests.One of the reasons he hasn't had success in the longest format is his preference to play with hard hands and drive on the up."
  },
  {
    "name": "James Neesham",
    "team": "New Zealand",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Batting Allrounder",
    "description": "Allrounder, and Twitter star, Jimmy Neesham went from the brink of retirement from cricket to almost delivering New Zealand the 2019 World Cup. In the tournament he was outstanding with bat and ball then in the final against England claimed three wickets and produced the final-ball run out to tie the scores after 50 overs. He was entrusted with the bat in the Super Over and scored 13 off 5 balls including a huge six off Jofra Archer."
  },
  {
    "name": "Devon Conway",
    "team": "New Zealand",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Wicketkeeper Batter",
    "description": "Eight years into his professional career, Devon Conway scored his maiden first-class double hundred for Gauteng in a three-day match in South Africa in 2017. Four years later he'd score another double, but this time for New Zealand on his Test debut, becoming only the second - but also the oldest - player to do so in the side, where he quickly established himself as an attacking but composed top-order batter with the ability to shift gears quickly to adapt to match situations. After moving to New Zealand at 26, following that 2017 game against Border, Johannesburg-born Conway was handed a contract by Wellington for the 2018-19 domestic season."
  },
  {
    "name": "Mitchell Santner",
    "team": "New Zealand",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowling Allrounder",
    "description": "A left-handed batsman and left-arm spinner, Mitchell Santner was first elevated to the New Zealand side after a promising 2014-15 domestic season. He was named in the one-day squad for the tour of England following the retirement of Daniel Vettori after the World Cup as New Zealand searched for another left-arm spin option. Santner was in to cover for the absence of the players at the IPL but made an immediate impression with a well-crafted 94 in a tour game against Somerset."
  },
  {
    "name": "Ish Sodhi",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": "Indian-origin legspinner Ish Sodhi moved to Auckland with his parents as a child, left school early and trained with Dipak Patel and Matt Horne to make it into the New Zealand ranks as a 20-year-old. A decade into his career, he was New Zealand's most prolific T20I spinner, and not too far behind in ODIs.Sodhi struggled somewhat to establish himself in regional representative teams."
  },
  {
    "name": "Finn Allen",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Top order Batter",
    "description": " Finn Allen player profile An opening batter who can also keep wicket, Finn Allen is arguably the hardest hitter of a cricket ball in New Zealand. His ability to go hard from ball one, and keep going hard, makes him a model opener in T20 cricket. He needed just four overs at the SCG in the 2022 T20 World Cup to put Australia on the brink of elimination."
  },
  {
    "name": "Mark Chapman",
    "team": "New Zealand",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": "Born in Hong Kong, but qualifying for New Zealand through his father, Chapman began his international career with the country of his birth in 2014 having previously made the Under-19 squad as a 15-year-old. He made a century on ODI debut against UAE in 2015 having flown 20 hours following exams in New Zealand, but soon decided to throw his lot in with New Zealand and focused on his career with Auckland. His first New Zealand call-up came in early 2018 for the T20 tri-series involving England and Australia."
  },
  {
    "name": "Lockie Ferguson",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Fiercely quick right-arm fast bowler Lockie Ferguson made an impact at the 2019 ODI World Cup in England with his bruising pace and bounce, taking 21 wickets at under 20 runs apiece and an economy rate of 4.88 - the second most wickets in the tournament. A sporadic presence in the Auckland side in his first two first-class seasons, Ferguson broke through in 2014-15 with 21 wickets at 23."
  },
  {
    "name": "Adam Milne",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Early in his career, Adam Milne, a lanky right-arm fast bowler, was spoken of as New Zealand's quickest bowler since Shane Bond but injuries disrupted his career far more than they did even Bond's. Milne made a dream first-class debut as an 18-year-old in the 2009-10 season, taking a wicket with his second ball and finishing with 4 for 52 against Canterbury, and was included Central District's T20 squad for the Champions League 2010 though he hadn't played a single game for them in the domestic competition. He turned out in two matches in the tournament and impressed with his pace, and was included in New Zealand's squad for their T20 series against Pakistan in December 2010."
  },
  {
    "name": "Michael Bracewell",
    "team": "New Zealand",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": "A member of the Bracewell cricket dynasty, Michael made a late introduction to international cricket, at the age of 31, when he was handed his ODI cap in 2022, against Netherlands, more than ten years after he made his first-class and List A debuts. The innings that vaulted him to the front of the selection queue was a monstrous 141 off 65 balls, which took Wellington from a position of 43 for 5 to chasing down Central Districts' 227 with a ball remaining in a Super Smash T20 match in January that year.Six months later he announced himself in white-ball international cricket with a similarly outrageous effort, smashing an unbeaten 127 off 82 balls from No."
  },
  {
    "name": "Glenn Phillips",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "Glenn Phillips is a compact, muscular hitter, known for playing outrageous shots, like the reverse pull. Born in South Africa, Phillips moved to New Zealand with his family at the age of five and has come through the cricket set-up in Auckland. He is a multi-dimensional player, who bats, bowls fastish offspin, fields superbly inside the ring and in the outfield, and keeps part-time as well."
  },
  {
    "name": "Tim Southee",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "Tim Southee, a right-arm swing bowler, burst upon the international scene in great style. He was still only 19, with only one T20I cap behind him, and fresh from a Player-of-the-Tournament performance at the 2008 Under-19 World Cup when he was handed a Test debut against England in Napier. Southee responded with 5 for 55 before smashing 77 off 40 balls in the second innings with nine sixes."
  },
  {
    "name": "Kane Williamson",
    "team": "New Zealand",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "Kane Williamson player profileBy the time Kane Williamson is finished with playing cricket, it is probable that he will be New Zealand's greatest batsman. Even Martin Crowe endorsed that view. But he may also finish as one of the game's most loved global figures."
  },
  {
    "name": "Shan Masood",
    "team": "Pakistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Opening Batter",
    "description": "A solid and technically sound left-hand opener, Shan Masood made it to the international side after impressing consistently at junior-level cricket. With Pakistan struggling to put together a solid opening combination, Masood was the option they turned to in the Test series against South Africa in the UAE.Masood caught the eye of Pakistan's talent-spotters quite early, being selected as a 13-year-old for the U-15 Asia Cup in 2002 after impressing Aaqib Javed."
  },
  {
    "name": "Mohammad Nawaz",
    "team": "Pakistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": "Mohammad Nawaz started out in cricket at the age of 14 as a left-arm medium-fast bowler and a middle-order batsman. An all-round performance of 60 runs and a four-for for Rawalpindi against Sialkot in an inter-region Under-16 tournament in 2008 earned him a place in the Pakistan side for the International Under-15 Championship in the West Indies. On the slow pitches of the Caribbean, he changed his bowling style to left-arm spin and transformed into a spin-bowling allrounder, with help from  coach Ameer Akbar and team manager Haroon Rashid."
  },
  {
    "name": "Naseem Shah",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Zarai Taraqiati Bank Limited may not be an esteemed name in Pakistan cricket, but it was for this deparment that Naseem Shah made his first-class debut at 15. With a natural, whippy action that generated easy pace, he immediately stood out even in that most competitive of fields - Pakistani fast bowling. A year later, he was making his Pakistan debut in Brisbane, though not before adversity touched him; he would lose his mother just before he received his first Pakistan cap."
  },
  {
    "name": "Babar Azam",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batter",
    "description": "A right-hand, top-order batsman known for his discipline and level-headed attitude, Babar Azam laid claim to a long-term spot in Pakistan's batting line-up with a strong performance in 2016, making three consecutive ODI hundreds against West Indies in the UAE, and a 90 in his third Test, in Hamilton. He was 22 years old at the time.Born in Lahore and a first cousin to the Akmal brothers, Azam made his way up through age-group cricket."
  },
  {
    "name": "Fakhar Zaman",
    "team": "Pakistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Opening Batter",
    "description": "Born in Mardan, where the standard of batsmanship will always be measured by arguably Pakistan's greatest Test batsman Younis Khan, Fakhar Zaman has been on Pakistan's thankless domestic circuit for over five years with almost no attention. A left-handed opener with an unusually high backlift, Zaman relies on timing for his runs, which he's made plenty of. This is illustrated by his domestic average (42 in first class cricket and 49 in List A)."
  },
  {
    "name": "Asif Ali",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Where was Asif Ali in the years Pakistan had been crying out for a power hitter? It took the exposure of the PSL for Asif Ali to come to prominence in an Islamabad United side that owed much to him for their title-winning campaign in 2018. A six in a Super Over against Mustafizur Rahman got their campaign up and running, and it wasn't until he smashed three sixes in arrow in a nerve-wracking chase that his side were assured victory. Those heroics saw him called up to the national side for three T20Is against West Indies, where he made the step-up with consummate ease."
  },
  {
    "name": "Khushdil Shah",
    "team": "Pakistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Middle order Batter",
    "description": []
  },
  {
    "name": "Haider Ali",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Middle order Batter",
    "description": []
  },
  {
    "name": "Mohammad Hasnain",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "At first glance, Mohammad Hasnain appeared born to be a Pakistan fast bowler. Hailing from the relative cricketing hinterlands of Hyderabad - him and Sharjeel Khan are the only two international cricketers from the city -  Hasnain's sleek, slender frame perched on a two-metre body and front-on action seem primed for high pace bowling.Hasnain and Naseem Shah emerged as young sensations for Quetta Gladiators in the PSL about the same time; at that stage, Hasnain was arguably the more exciting prospect."
  },
  {
    "name": "Mohammad Wasim",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Iftikhar Ahmed",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "In 2023, making what seemed to be his nth comeback to the Pakistan ODI side, offspinner allrounder Iftikhar Ahmed burst into flower with an unbeaten 94 from No. 6 against New Zealand in the fifth ODI (after Pakistan had sealed the series) - though the target of 300 proved a bridge too far for him and his side. Up until then, the lone highlight of Iftikhar's white-ball international career had been his 5 for 40 against Zimbabwe in his sixth match, in 2020, which came five years after his first."
  },
  {
    "name": "Shaheen Shah Afridi",
    "team": "Pakistan",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast",
    "playingRole": "Bowler",
    "description": "A baby face perched on a two-metre body, Shaheen Afridi's story is trademark Pakistani. An 18-year old already comfortable in the green shirt of the national side, he's been on the radar of the national selectors for almost three years. In a more intimate circle, he was destined for great achievements well before his teenage years, with an international cricketer for an elder brother."
  },
  {
    "name": "Mohammad Haris",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": []
  },
  {
    "name": "Shadab Khan",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Allrounder",
    "description": "A prodigious turner of the ball, teenage legspinner Shadab Khan burst onto cricket's collective consciousness only during the 2016/17 PSL season. His ability to take wickets while maintaining an excellent economy rate saw him talked up as that most frequent of phenomena: an exciting Pakistani prospect. Shadab is not afraid of bowling the wrong'un either; his only criticism might be that he bowls it a bit too often, but that hasn't helped batsmen pick it up any better, either out of the hand or off the pitch."
  },
  {
    "name": "Haris Rauf",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "By and large, the quixotic idea of a Pakistan fast bowler suddenly emerging upon everyone's radar fully formed is something of an urban legend. But that is almost precisely how Haris Rauf appeared, as if conjured simply by the power of the fast-bowling spirit that always seems to lurk around the country.Growing up completely outside of the formal Pakistan cricket system, a 24-year-old Rauf showed up to audition for Lahore Qalandars' player development programme in 2017, having only played tape-ball cricket until that point."
  },
  {
    "name": "Mohammad Rizwan",
    "team": "Pakistan",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Wicketkeeper Batter",
    "description": "For several years, it appeared Mohammad Rizwan's international career would only happen in a parallel universe, racking up domestic runs even as he struggled to get a game in the national side. But for someone who played an international for the first time in two years in January 2019, Mohammad Rizwan was spoken of remarkably frequently. Most often, he was used as a stick to threaten current first-choice Pakistan wicketkeeper and captain Sarfaraz Ahmed, but the Peshawar native had qualities of his own that suggested he might have been unfortunate not to play for Pakistan more often."
  },
  {
    "name": "Josh Davey",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "Josh Davey's seam-bowling talent was recognised when Middlesex gave him his county debut at the age of 19. But, although he was involved with the county for four years, the seam-bowling allrounder failed to push on, and he was released at the end of 2013 and moved west to Somerset. Born in Aberdeen, Davey made his ODI debut in 2010, the same year as his first county appearance, and immediately made a sterling impression by taking 5 for 9 against Afghanistan."
  },
  {
    "name": "Brandon Mcmullen",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Batting Allrounder",
    "description": []
  },
  {
    "name": "Michael Leask",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "Michael Leask is an explosive batsman from Aberdeen. He showed as much when he smeared five sixes during a memorable 16-ball 42 in an ODI against England in May 2014. But he has been hampered by inconsistency, and he only mustered 56 runs at an average of 9."
  },
  {
    "name": "Calum Macleod",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast, Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "Calum MacLeod won a place in Scottish sport folklore when he struck a century that helped Scotland beat the world's No. 1 ODI side at the time, England, in a game in Edinburgh in 2018. That year, he also produced an unbeaten 157 against Afghanistan in a World Cup Qualifier match in Bulawayo, where he expertly dealt with legspinner Rashid Khan, liberally employing a sweep shot that he put down to his time spent playing hockey."
  },
  {
    "name": "Chris Greaves",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Richie Berrington",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Top order Batter",
    "description": "Richie Berrington powered Scotland to their long-awaited first victory over an ICC Full Member when his century, which was made in only 56 balls and included five sixes, set-up victory over Bangladesh in a T20 international in July 2012A batting allrounder who can bowl seam, Berrington was born in Pretoria but emigrated to Scotland as a youth and has been part of their set-up since his days in the Under-15 side. His early promise was clearly evident and as an 18 year old he was sent to India as part of the ICC's European Cricket Academy.Berrington had played for Scotland's Under-19 side while still eligible for their Under-17s, and was part of the squad that took part in the Under-19 World Cup in Sri Lanka in February 2006."
  },
  {
    "name": "Craig Wallace",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": []
  },
  {
    "name": "Chris Sole",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Michael Jones",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "The summer of 2022 saw opener Michael Jones finally convert promise into solid first-team returns. He began his fifth season as a Durham cricketer with a maiden first-class hundred at Grace Road, in the second round of the Championship, and followed that up a few months later by batting for more than eight hours to amass 206 from 381 balls against Middlesex at Chester-le-Street.Jones finished the season with 878 runs at 51."
  },
  {
    "name": "George Munsey",
    "team": "Scotland",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Opening Batter",
    "description": "Known as the reverse-sweeping demon of the Associate world, George Munsey's path to the Scotland national team is as unorthodox as his trademark shot. Born and raised in Oxford, Munsey had dreams of becoming a professional golfer and it was a golf scholarship to the Loretto School, just outside Edinburgh, that brought him to Scotland at age 13. However, Munsey's self-realisation that he preferred a team environment over the individualistic nature of golf began to take shape while captaining the cricket team at the school."
  },
  {
    "name": "Matthew Cross",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "A wicketkeeper-batter from Aberdeen, Matthew Cross got into the Scotland set-up at U-13 level, progressed up the ranks, making a good impression as vice-captain for the U-19s in the 2012 World Cup in Australia, and then broke into the senior side the following year.In his younger years Cross showed promise at football, representing Aberdeen FC at U-15 level but committed to cricket while juggling his engineering degree studies at MCC Loughborough University. In 2013 he was on the books at Nottinghamshire and scored 47 in his only senior game, against Bangladesh A."
  },
  {
    "name": "Brad Wheal",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Brad Wheal, a right-handed batsman and right-arm pace bowler, was born in Durban, South Africa but holds a British passport and moved to England with the encouragement of Hampshire's head coach at the time, Dale Benkenstein, who had spotted him playing for Natal Under-19. He played four Championship matches in 2015, accounting for an England opener, Sam Robson, on his debut. A Scotland debut, at 19, followed in 2016, a year in which his experience was also developed with eight further Championship matches."
  },
  {
    "name": "Mark Watt",
    "team": "Scotland",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "Scotland left-arm spinner Mark Watt made a quiet international debut in 2015 but drew attention to himself more firmly two years on when he took five wickets against Netherlands in a T20I in Dubai, despatching them from 82 for 4 to nine down for less than 100. Later that year, he took three in a famous win against England in an ODI, Scotland's first. Watt won opportunities with Lancashire that summer, although he only took one wicket in four matches."
  },
  {
    "name": "Hamza Tahir",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Safyaan Sharif",
    "team": "Scotland",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "Born in Huddersfield, Safyaan Sharif made his debut for Scotland at 20 after eye-catching performances for Dunfermline and Scotland U-19s, and took 4 for 27 against the Netherlands in his first ODI in 2011. With 14 wickets at 23.92 apiece, his fast-medium bowling played an important part in Scotland's success in the World Cup Qualifiers in New Zealand in 2014."
  },
  {
    "name": "Rilee Rossouw",
    "team": "South Africa",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Top order Batter",
    "description": "A stylish top-order player with an elegant and authoritative drive, Rilee Rossouw has been a high-impact batter for South Africa in limited-overs cricket.  He first came to attention in the 2008 Under-19 World Cup, after which he was the leading run-scorer in the South African first-class competition in 2009-10, with 1189 runs at 66.05."
  },
  {
    "name": "Lungi Ngidi",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "A tall, imposing 140kph-plus fast bowler, Lungi Ngidi is as comfortable opening the bowling as he is at the death, and has been a regular presence in South Africa's sides, if not quite a shoo-in. Ngidi played for Kwa-Zulu Natal Under-19s at the Khaya Majola week in 2014, where he was spotted by Northerns, moved upcountry to hone his skills at the University of Pretoria, and was identified as a T20 prospect when he was the joint second-highest wicket-taker in the provincial Africa Cup T20 tournament. He was promoted to Northerns' franchise team, Titans, for parts of their T20 campaign in 2015-16, played in the final, which they won, and was a central figure in their title defence the following season."
  },
  {
    "name": "Quinton De Kock",
    "team": "South Africa",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "Quinton de Kock player profileQuinton de Kock's fearless striking and handy glovework earned him comparisons to greats of the game like Adam Gilchrist and Mark Boucher early in his career. By 21, he shared the record for the most successive ODI centuries - three - before it was bettered by Kumar Sangakkara. A year later, he had established himself in all three formats for South Africa."
  },
  {
    "name": "Heinrich Klaasen",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "A wicketkeeper-batter known for his belligerent six-hitting, Heinrich Klaasen first got his chance in the South African team as an injury replacement, opening in place of Quinton de Kock, but went on to establish himself in the middle order in limited-overs cricket. Schooled at Menlopark High School and the University of Pretoria, Klaasen made his first-class debut for Northerns in the 2012-13 season and averaged 42.58 in the provincial three-day cup."
  },
  {
    "name": "Aiden Markram",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Opening Batter",
    "description": "The first South Africa captain to win a World Cup, albeit at age-group level, Aiden Markram announced himself as champion material early. He led South Africa's Under-19s to World Cup glory in 2014 and was also their leading run-scorer and third overall. It took him another three years to break into the senior side, but when he did, he made an impact right away with 97, 143 and 125 in his first three Tests, at home against Bangladesh and Zimbabwe."
  },
  {
    "name": "Wayne Parnell",
    "team": "South Africa",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Bowler",
    "description": "An aggressive left-handed seamer, who bowls with as much venom as he bats, Wayne Parnell was earmarked for success early and spent the next few years trying to get there. Inconsistency and injury were his nemeses, however, and that led to him abandoning international cricket with South Africa and signing a three-year deal with Worcestershire as a Kolpak after the 2018 English season.Parnell signed immediately after becoming a member of the Worcestershire side that won the T20 Blast for the first time."
  },
  {
    "name": "Tristan Stubbs",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batter",
    "description": "A batter seemingly born for the modern game, Tristan Stubbs is known for his fearless approach to batting. But there is more to him than just big-hitting. Stubbs also takes an energetic approach to longer-formats, and within four years of making his first-class debut, averaged over 50 in it."
  },
  {
    "name": "Keshav Maharaj",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "A left-arm spinner from Northwood Boys High, the alma mater of Shaun Pollock, Keshav Maharaj emerged at a time when South Africa began to take spin seriously. For several seasons in the mid 2010s, spinners were among the leading wicket-takers in South Africa's first-class competition. Maharaj was among them in the 2014-15 and 2015-16 seasons and was rewarded with an international call-up the following summer."
  },
  {
    "name": "David Miller",
    "team": "South Africa",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "David Miller player profileA hard-hitting left-hander with a penchant for clearing the boundary, David Miller made famous the phrase \"If it's in the arc, it's out the park.\" Miller is a self-styled finisher who is strong off the front and back foot and eager to swing his arms, as well as a gun fielder. He made his first-class debut in 2008 at the age of at 18 and two years later, his international debut on South Africa's tour of West Indies."
  },
  {
    "name": "Dwaine Pretorius",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowling Allrounder",
    "description": "A late-blooming allrounder who swapped pace for precision because of knee injuries, Dwaine Pretorius offered awayswingers and lower-order runs to South Africa in the post-Kallis era.He missed the 2008 Under-19 World Cup after tearing a cartilage in his right knee, and chose to pursue an accounting degree for the next three years. After he returned to the game, Pretorius was named the T20 Amateur Cricketer of the Year in 2011-12 and was included in the Lions squad for the 2012 Champions League T20, but the knee flared up again and he required surgery."
  },
  {
    "name": "Kagiso Rabada",
    "team": "South Africa",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Kagiso Rabada player profileA strapping, genuine quick who regularly bowls in the 140-150kph range, Kagiso Rabada is the most exciting talent to emerge from South Africa in the post No.1 Test ranking era. Before he had turned 21, Rabada had already established himself as a potential leader of the attack."
  },
  {
    "name": "Anrich Nortje",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Anrich Nortje player profileWith an ability to combine high speed with late swing, Nortje is the ideal successor to his hero Dale Steyn in South Africa's pace attack. He set the 2018-19 Mzansi Super League ablaze, attacking the stumps at 150kph and taking eight wickets in three matches - including the dismissals of Hashim Amla, Temba Bavuma and Reeza Hendricks - at an average of 10.4."
  },
  {
    "name": "Temba Bavuma",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Middle order Batter",
    "description": "From the same street in Langa, a township outside Cape Town, where Thami Tsolekile and Malusi Siboto were raised, came Temba Bavuma. Unlike the wicketkeeper-batsman and medium-pacer, Bavuma is a specialist batsman and the first black African batsman picked in South Africa's Test squad. Without the advantage of height or power, Bavuma's game is built on finesse and patience and has been since he moved up country for secondary school at St David's Marist College in northern Johannesburg."
  },
  {
    "name": "Tabraiz Shamsi",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Wrist spin",
    "playingRole": "Bowler",
    "description": "A left-arm wristspin bowler with ample variations and a good googly, Tabraiz Shamsi emerged as South Africa were starting to warm to the wave of spinners being produced at domestic levels, although it took a while for him to come through. Shamsi bounced between the Highveld and Kwa-Zulu Natal and pushed for a place at franchise level after a strong 2013-14 season for Easterns. He took 47 wickets at 20."
  },
  {
    "name": "Reeza Hendricks",
    "team": "South Africa",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Opening Batter",
    "description": "Reeza Hendricks has fashioned a reputation as a destructive T20 opener, with crisp shot-making, particularly through the covers, and one adept at pacing a knock and scoring quickly at either end of an innings. Hendricks made his international debut in a T20I series against Australia in 2014, where he made 49 in the third match. In August 2018 he joined the short list of South Africans to have made a century in their first ODI, cracking 102 from 89 balls against Sri Lanka to seal an away series win."
  },
  {
    "name": "Danushka Gunathilaka",
    "team": "Sri Lanka",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "A poised, attacking left-handed opener groomed in part at Sinhalese Sports Club, Danushka Gunathilaka was plucked from the domestic system largely on potential, and drafted into Sri Lanka's A team for the tour of New Zealand in mid-2015. He impressed on that trip, hitting two smart fifties from four innings, to finish as the team's second-highest run-scorer.Those performances earned him a national call-up for the home series against West Indies in November."
  },
  {
    "name": "Chamika Karunaratne",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Ashen Bandara",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Middle order Batter",
    "description": []
  },
  {
    "name": "Bhanuka Rajapaksa",
    "team": "Sri Lanka",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Top order Batter",
    "description": "An attacking left-handed batsman, Bhanuka Rajapaksa was selected for the 2010 Under-19 World Cup in New Zealand as one of the team's key batsmen. He lived upto his reputation, by finishing the leading run-scorer for his country with 253 runs. He had an excellent tour of Australia with the U-19 team in 2009, smashing 154 off 111 balls in a one-dayer and ended the series as the leading run-getter."
  },
  {
    "name": "Charith Asalanka",
    "team": "Sri Lanka",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Batting Allrounder",
    "description": []
  },
  {
    "name": "Dasun Shanaka",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Allrounder",
    "description": "An explosive middle-order batsman, and steady right-arm seam bowler, Dasun Shanaka worked his way into Sri Lanka's T20 side through several seasons of good performances for Sinhalese Sports Club. Born and educated in Negombo, Shanaka made his T20 international debut against Pakistan in August 2015, but it wasn't until the following domestic season that he achieved wide acclaim. Batting at No."
  },
  {
    "name": "Jeffrey Vandersay",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Binura Fernando",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Bowler",
    "description": "Known for his ability to generate awkward bounce from a height of 6'7\", and swing the ball, Binura Fernando has been among the leading schoolboy-cricket names over the past two years, claiming 84 wickets in the 2013 season. A left-arm seamer, Fernando was called up to Sri Lanka's Test squad during the 2014 home series against Pakistan despite not having played first-class cricket. He was chosen largely on the strength of his performances for DS Senanayake College and the Sri Lanka Under-19 team."
  },
  {
    "name": "Kusal Mendis",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "Blessed with a compact technique, an aggressive impulse, and an iron resolve, Kusal Mendis rose rapidly through the age-group system, and quickly became one of the most promising young batsmen in the world. He had played only 16 first-class innings before he made his Test debut at the age of 20, and had hit only one first-class hundred before he made a maiden Test ton. That hundred - the 176 against Australia at Pallekele - was a match-flipping, series-defining knock, which given the fact no other batsman mustered more than 55 in the game, is one of the greatest ever Sri Lankan innings."
  },
  {
    "name": "Maheesh Theekshana",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Dushmantha Chameera",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Tall, slim and slippery, Dushmantha Chameera arrived at NCC in 2012, and was quickly marked out as a bowler for the future. First among his virtues is pace, generated from a slightly round-arm action that sacrifices movement. Capable of consistently hitting speeds of over 140 kph, coaches believe he had become the quickest bowler in the country by 23."
  },
  {
    "name": "Dilshan Madushanka",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Kasun Rajitha",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": "Virtually unheard of before 2015, the first inkling of right-arm seamer Kasun Rajitha's potential came during a three-dayer against the touring Indians in August of that year. He took 5 for 68 on a spicy Khettarama deck in that match, dismissing Shikhar Dhawan, Virat Kohli and Rohit Sharma in a single spell, before claiming Kohli's wicket in the second innings as well.Achieving appreciable seam movement at a sharp pace, and from a high release point, Rajitha proved to be a penetrative T20 bowler in the following domestic season."
  },
  {
    "name": "Pathum Nissanka",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Top order Batter",
    "description": []
  },
  {
    "name": "Dhananjaya De Silva",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "A stylish middle-order batter who also props up Sri Lanka's mediocre batting line-up with fighting knocks, de Silva is a treat to watch. An eye-catching domestic season in 2016 got him a Test call-up, and he showed his potential with a hundred and a half-century against Australia in his third Test. He also scored match-winning hundreds in Harare, and at home against West Indies and Pakistan, the latter two scores coming in the second innings, but more often than not, de Silva was playing with his back to the wall, in the midst of a collapse, like the hundred to save the Delhi Test in 2017 and 46 and 47 not out to help Sri Lanka survive longer in Christchurch in 2023."
  },
  {
    "name": "Asitha Fernando",
    "team": "Sri Lanka",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Lahiru Kumara",
    "team": "Sri Lanka",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "A robust, right-arm fast bowler from Kandy, Lahiru Kumara had played only eight days of first-class cricket - all of which were for the Sri Lanka A team - before he was selected in the Test squad in October 2016. He was largely picked on his promise. One of the fastest bowlers in Sri Lanka's system, Kumara possesses a sharp bouncer, and an ability to both swing and seam the ball - all allied to a bustling intensity."
  },
  {
    "name": "Chirag Suri",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak, Legbreak Googly",
    "playingRole": "Opening Batter",
    "description": "Two days after his 22nd birthday, opening batter Chirag Suri was bought in the 2017 IPL auction by Gujarat Lions. It was quite the birthday present, considering he had not even been capped in internationals for UAE. Suri never suited up for Lions, but he has demonstrated his talents in the time since his UAE international debut, also in 2017, rocketing up the career batting charts to figure among the top five run-makers in both ODIs and T20Is for his country."
  },
  {
    "name": "Basil Hameed",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": []
  },
  {
    "name": "Alishan Sharafu",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Ahmed Raza",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "Six-foot-five Ahmed Raza is best known for his economical spells of left-arm spin. In a must-win World Cricket Division Two game for UAE against Oman in 2018, he conceded only 16 runs in nine overs for two wickets, and in an Asia Cup match against Oman in 2016, he took 1 for 6 from three overs. In December 2018, Raza, who has juggled a job as a bank officer while playing professional cricket, was one of three UAE players suspended for eight weeks for criticising the ground facilities in Karachi."
  },
  {
    "name": "Karthik Meiyappan",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Cp Rizwan",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak Googly",
    "playingRole": "Middle order Batter",
    "description": "Born in Kerala, Rizwan is a right-hand batter and legbreak bowler. As a youngster, he moved to the UAE with his family but returned to India for his studies, playing U-19 and U-23 cricket for Kerala. In 2014 he moved back to the UAE and made his ODI debut in January 2019 against Nepal."
  },
  {
    "name": "Fahad Nawaz",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Junaid Siddique",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Aryan Lakra",
    "team": "U.A.E.",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Sabir Ali",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Zawar Farid",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Aayan Afzal Khan",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Muhammad Waseem",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Opening Batter",
    "description": []
  },
  {
    "name": "Kashif Daud",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowling Allrounder",
    "description": []
  },
  {
    "name": "Zahoor Khan",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowler",
    "description": []
  },
  {
    "name": "Vriitya Aravind",
    "team": "U.A.E.",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": []
  },
  {
    "name": "Yannic Cariah",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Bowler",
    "description": "A legspinner and a left-hand batter, Yannic Cariah grew up watching videos of Shane Warne and Brian Lara. Cariah has a quickish run-up and he gets the ball to turn and bounce. He made his T20I debut days before he was selected for the T20 World Cup 2022."
  },
  {
    "name": "Jason Holder",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Bowling Allrounder",
    "description": "Jason Holder was seen as a future talent until a selection panel headed by former World Cup-winner Clive Lloyd appointed him West Indies' ODI captain in 2014. Holder was only 23 at the time, and was still making his way as a fast bowler and a lower-middle order batsman. Less than a year later, he took over the Test team too, indicating how much the WICB and men in the know - ranging from Viv Richards to Brian Lara to Tony Cozier - believed in this man, who comes across as remarkably level-headed and mature for someone so young."
  },
  {
    "name": "Sheldon Cottrell",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "Once a soldier in the Jamaican Defence Force, left-armer Sheldon Cottrell has been a semi-regular presence in the West Indies white-ball sides since he made his debut in 2013, and is known as much for his elaborate army-salute wicket celebration as for his bowling performances. He also offers athleticism in the field and powerful hitting in the lower order. Cottrell broke through with 17 wickets at under 20 apiece in the four-day regional competition in 2012-13."
  },
  {
    "name": "Nicholas Pooran",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "Nicholas Pooran player profileNicholas Pooran confirmed his status as one of the most exciting young batting talents in the modern game with a sublime innings of 118 off 103 in West Indies' defeat to Sri Lanka at the 2019 World Cup, but only four years earlier the idea that he would play international cricket seemed fanciful.A year after finishing as the fourth-highest run-scorer at the U-19 World Cup in early 2014, Pooran was involved in a serious car accident which left him with a torn patella tendon, fractured tibia and fractured ankle. After a long recovery process, he was handy a substantial contract for Barbados Tridents in the 2016 CPL on Kieron Pollard's recommendation."
  },
  {
    "name": "Odean Smith",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowling Allrounder",
    "description": "Among a line of modern West Indies pace-bowling allrounders in limited-overs cricket, Odean Smith modelled himself on Andre Russell. He was mainly used as a bowler initially in his competitive career. The first glimpse of Smith's impactful ball-striking abilities, though, came for West Indies B at the Super50 Cup in October 2018, more than three years after his List A debut."
  },
  {
    "name": "Raymon Reifer",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Medium fast",
    "playingRole": "Allrounder",
    "description": "The fourth first-class cricketer from a family that includes former Test captain Floyd Reifer, Raymond Reifer has made his name for his all-round abilities. A left-arm seamer who can score useful runs down the order, Reifer's mid-20s averages with both bat and ball reflect his consistency in first-class cricket. He played a major role in Guyana's run to the 2016-17 four-day title, with 36 wickets at 21."
  },
  {
    "name": "Johnson Charles",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "A muscular opener with a penchant for swatting the ball square either side of the wicket, much like Dwayne Smith, Johnson Charles was part of West Indies' T20 World Cup winning teams in 2012 and 2016. While Smith's second skill is seam bowling, Charles' is wicketkeeping. With Denesh Ramdin representing West Indies in all three formats, and Andre Fletcher also in the limited-overs mix, West Indies have used Charles' second skill sparingly."
  },
  {
    "name": "Rovman Powell",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Medium fast",
    "playingRole": "Middle order Batter",
    "description": "A middle-order batter who bowls occasional medium pace, Rovman Powell has been a semi-regular presence in West Indies' white-ball squads from the mid-2010s without quite nailing down a spot. Powell's maiden ODI hundred, against Ireland in 2018, helped West Indies to a crucial win in the World Cup qualifier, and he captained a weakened side in Bangladesh later that year, but was left out of the squad for the World Cup itself, in 2019.He has been a consistent performer for Jamaica in white-ball cricket, with runs from the middle order, and captained the Tallawahs franchise in the 2020 CPL."
  },
  {
    "name": "Evin Lewis",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": [],
    "playingRole": "Opening Batter",
    "description": "\"I hit a lot of sixes, big sixes like him,\" Evin Lewis said when asked why he chose Chris Gayle as his mentor. For an upcoming left-handed opening batsman, especially in the modern game, that's a fairly smart pick.Lewis moved up the ranks playing age-group cricket for Trinidad & Tobago, and was part of a championship winning Under-19 side in 2008."
  },
  {
    "name": "Brandon King",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Top order Batter",
    "description": "Brandon King got his start as a solid middle-order batter for Jamaica before a promotion to the top order in the CPL unlocked his power-hitting potential, and culminated in a call-up to West Indies' white-ball side.King made his first-class debut for Jamaica in 2014-15 but had a breakout season in 2018-19, when he racked up 630 runs in seven games, landing him a middle-order slot in the West Indies A side. King also debuted in the CPL in 2017 with St Kitts and Nevis Patriots, but flew under the radar until his switch to Guyana Amazon Warriors in 2019, where coach Johan Botha spotted his potential and bumped him up the order."
  },
  {
    "name": "Shamarh Brooks",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Top order Batter",
    "description": "In full flow, Shamarh Brooks is all elegance. He drives mercilessly through the off side and often finishes his flicks standing on one leg. But it took four innings in Tests before these skills were visible."
  },
  {
    "name": "Kyle Mayers",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Medium",
    "playingRole": "Batting Allrounder",
    "description": "A left-handed batsman who bowls useful medium pace, Kyle Mayers travelled to England as a reserve for West Indies in 2020 before making his T20I debut in New Zealand later in the year. He had won his place on the back of some impressive form in regional cricket for Barbados, making his maiden professional hundreds in 2019-20. In the Regional Super50, he hit 113 from the middle order against the Leeward Islands, before finishing second to Jermaine Blackwood in the four-day run-scoring charts as Barbados cantered to the title."
  },
  {
    "name": "Obed Mccoy",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "A left-arm fast bowler from the Windward Islands, Obed McCoy's skilful changes in pace made him a natural fit for the T20 format.He made his domestic debuts in all three formats in 2017, and less than a year later he was playing for West Indies in an ODI against India. While his 50-over career did not take off, McCoy became a fairly regular player for West Indies in T20Is, representing them in the 2021, 2022 and 2024 T20 World Cups."
  },
  {
    "name": "Akeal Hosein",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "Akeal Hosein was handed a chance to impress for West Indies in Bangladesh in early 2021 after several senior players opted out of the tour, but his opportunity had been a long time coming. Primarily a white-ball spinner, Hosein played in the Champions League T20 as a youngster, taking three wickets in as many games for Barbados Tridents. In 2019-20, he proved his red-ball credentials, snaring 36 wickets in the regional four-day competition for Trinidad and Tobago, and chipping in with some useful runs from the lower-middle order."
  },
  {
    "name": "Shimron Hetmyer",
    "team": "West Indies",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": [],
    "playingRole": "Middle order Batter",
    "description": "Left-hander Shimron Hetmyer catches the eye as much for his attacking strokeplay as for his hair, coloured various shades of the rainbow. He started out leading West Indies to their first Under-19 World Cup title, in 2015-16, and then made his name as a lower-middle-order bruiser in T20 cricket. In the early 2020s in the IPL, his ability to go from zero to 60 in no time paid dividends for Delhi Capitals and Rajasthan Royals."
  },
  {
    "name": "Alzarri Joseph",
    "team": "West Indies",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Bowler",
    "description": "Tall fast bowler Alzarri Joseph started out as a legspinner in his backyard in Antigua before his height marked him out for a different style of bowling. In his teens he gained a reputation as one of the fastest bowlers on the school circuit, which carried over into the 2016 Under-19 World Cup, where he bowled the competition's fastest delivery, a 147kph zinger that broke Zimbabwe batter Brendan Sly's stumps. Joseph would finish as West Indies' highest wicket-taker of the tournament, with 13 wickets from six games at an economy of 3."
  },
  {
    "name": "Craig Ervine",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Middle order Batter",
    "description": "Few people in Zimbabwe cricket circles were surprised when Craig Ervine found his way into Zimbabwe colours. A stylish left-handed middle-order batsman, Ervine hails from a family with a strong cricketing tradition - his father and uncle both played first-class cricket, albeit briefly, in the late 1970s, his older brother Sean had a promising fledgling international career with Zimbabwe before heading to England to become a reliable cog in Hampshire's middle order, and even younger brother Ryan has turned out for the Southern Rocks franchise on occasion.But it is somewhat surprising that Ervine is playing cricket at all, as a freak accident in his early teens - he slipped and fell on a broken glass in his family's living room - required a three-hour reconstructive operation to his right hand."
  },
  {
    "name": "Luke Jongwe",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Allrounder",
    "description": "Luke Jongwe player profileA right-arm medium fast bowler and useful lower middle-order batter, Luke Jongwe was only 19 when he was handed an ODI debut and 20 when he made his T20I debut. However, his international career has been more of a stop-start, including long stints on the sidelines.Jongwe first represented Zimbabwe at the Under-19 World Cup in 2012 and 2014."
  },
  {
    "name": "Clive Madande",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": [],
    "playingRole": "Wicketkeeper Batter",
    "description": "A hard-hitting middle order batter and wicketkeeper, Clive Madande quickly rose up the ranks in Zimbabwe cricket after making his first-class debut for Matabeleland Tuskers in March 2021 against Mashonaland Eagles. Within the next three weeks, he had made his List A and domestic T20 debut.In just his second first-class game, Madande scored 56 and followed it up with an unbeaten 117 against Eagles two games later."
  },
  {
    "name": "Sean Williams",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Middle order Batter",
    "description": "Sean Williams is a bold, dynamic left-hand batsman, and one of the most striking features about his batting is his proficiency at the reverse-sweep. That shot has occupied a proud position in the repertoire of some of Zimbabwe's finest batsmen: legend has it that Dave Houghton brought up both his hundred and his double with reverse-sweeps in the course of his 266 against Sri Lanka, and Andy Flower used the stroke in an almost profligate manner in many of his memorable innings. Williams is as adept at the stroke as either of these two elder statesmen of Zimbabwean cricket, which he proved during the course of his maiden Test century against New Zealand in Bulawayo in July 2016."
  },
  {
    "name": "Richard Ngarava",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Left arm Fast medium",
    "playingRole": "Bowler",
    "description": "Richard Ngarava player profileRichard Ngarava first received global attention at the Under-19 World Cup in 2016, when he, the last man for Zimbabwe, was run-out backing up at the non-striker's end by Keemo Paul to send West Indies into the quarter-finals.Over time, Ngarava has become one of the mainstays of the Zimbabwe bowling unit. Well-built and standing at over six feet, the left-arm fast bowler has the ability to extract pace and lift from the flattest of decks."
  },
  {
    "name": "Milton Shumba",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Top order Batter",
    "description": " Milton Shumba player profile A top-order batter and a useful left-arm spinner, Milton Shumba represented Zimbabwe in three Under-19 World Cups: 2016, 2018 and 2020. He did not play a game in 2016 but was the second and third-highest run-getter in the 2018 and 2020 editions for Zimbabwe.Shumba was yet to turn 16 when he made his T20 debut for Zimbabwe against Eastern Province in the Africa T20 Cup."
  },
  {
    "name": "Sikandar Raza",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak, Legbreak",
    "playingRole": "Batting Allrounder",
    "description": "Sikandar Raza's story isn't that of your everyday international cricketer. He is not a teenage prodigy, nor is he someone who had a burning ambition to play for his country. He journeyed through from his adolescence to adulthood and stumbled upon the sport he sometimes played as a child, only to discover he is quite good at it."
  },
  {
    "name": "Tony Munyonga",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": "A middle order batter and a decent offspinner, Tony Munyonga broke into the Zimbabwe national side less than two years after making his first-class debut. He first turned out for Rising Stars in the 2017-18 Logan Cup and scored a half-century in just his second game against Mashonaland Eagles.Munyonga subsequently made his List A debut in the Pro50 Championship in April 2018."
  },
  {
    "name": "Wellington Masakadza",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Slow Left arm Orthodox",
    "playingRole": "Bowler",
    "description": "The youngest of the three Masakadza brothers to play international cricket for Zimbabwe - the others being Hamilton and Shingirai - Wellington Masakadza is a left-arm orthodox spinner and a useful lower middle-order batter. Masakadza first turned out for Zimbabwe at the 2012 Under-19 World Cup where he played three games and picked three wickets while scoring 24 runs.It took him close to a year and a half to make his first-class debut for Mountaineers in the 2013-14 domestic season where he picked 5 for 63 in his very first outing against Matabeleland Tuskers."
  },
  {
    "name": "Ryan Burl",
    "team": "Zimbabwe",
    "battingStyle": "Left hand Bat",
    "bowlingStyle": "Legbreak",
    "playingRole": "Allrounder",
    "description": "Ryan Burl liked playing squash when he was at school, but his love of cricket - specifically, the team game's camaraderie - made him want to be an international cricketer. A left-hand lower-middle-order batter and occasional legspinner, Burl broke into the Zimbabwe side in 2017, and has also played in the BPL and Afghanistan's Shpageeza Cricket League.Sports-mad Burl studied at Peterhouse Boys School outside of Harare, which has produced England internationals Gary Ballance and the Currans, Sam and Tom; Italian rugby star Sebastian Negri; and Olympic rower Peter Purcell-Gilpin."
  },
  {
    "name": "Tendai Chatara",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "The first thing one notices when watching Tendai Chatara bowl is his curiously lopsided action, his left arm almost glued to his side as he rushes through the crease. But at the other end of that action there have been wickets - and lots of them. A tall, wiry fast bowler with appreciable pace and the ability to move the ball away from the right hander, Chatara has risen quickly to prominence since his first-class debut for Mountaineers in 2009."
  },
  {
    "name": "Wessly Madhevere",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Blessing Muzarabani",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast medium",
    "playingRole": "Bowler",
    "description": "Perhaps the most exciting fast-bowling talent to emerge from Zimbabwe since Heath Streak, Blessing Muzarabani has a whip-like action reminiscent of Kagiso Rabada and the ability to extract steep pace and bounce with his 6'6\" frame. They have made him one of the defining faces of a newly resurgent Zimbabwe side.Seven-year-old Muzarabani was discovered by his school coach while training at the Takashinga Cricket Club, on the outskirts of Harare."
  },
  {
    "name": "Brad Evans",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Fast",
    "playingRole": "Allrounder",
    "description": []
  },
  {
    "name": "Regis Chakabva",
    "team": "Zimbabwe",
    "battingStyle": "Right hand Bat",
    "bowlingStyle": "Right arm Offbreak",
    "playingRole": "Wicketkeeper Batter",
    "description": "A doughty wicketkeeper-batter, Regis Chakabva came up in Zimbabwe cricket through Highfields, Churchill, on to Takashinga, provincial cricket, and eventually, regular appearances in the national teams. Chakabva represented Zimbabwe in the Afro-Asia Under-19 Cup in 2005, but despite the rebel crisis and subsequent player drain, had to queue up behind the likes of Tatenda Taibu, Brendan Taylor and Richmond Mutumbami for a place in the senior sides. Though he had a disappointing run during the Pakistan Cricket Academy's visit in 2008, he was included in Zimbabwe's squad for their trip to Canada soon afterwards and made his international debut in a T20I against Pakistan in King City."
  }
]
